[
  {
    "url": "https://www.changiairport.com/",
    "content": "Airport Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Areas "
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel Ch"
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "angi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys (Fo"
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "r Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest Ch"
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "angi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en zh × All Changi Sites: Language Select: Logout HELLO FROM CHANGI GO PLACES YOU'VE DREAMED OF SG60 Celebrations Join the SG60 fun with a charity walkathon, local performance, lush blooms & a dazzling outdoor light-up for everyone! Your browser does not support HTML video. I AM ARRIVING ARRIVING DEPARTING TRANSITING VISITING USEFUL INFORMATION FOR {DIRECTION} PASSENGERS What’s Happening BLACKPINK WORLD TOUR <DEADLINE> IN SINGAPORE SPEND & WIN PROMOTION Spend S$60 at Changi Airport for a chance to win a pair of tickets. Outlet Deals Shop and save: check out the latest deals! Shop more when you fly! Shop and dine at par"
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "ticipating transit stores to be rewarded with free Changi Return e-Vouchers. Kids' Activity Booklet Get an activity booklet when you dine with kids at selected outlets! Tea Time Deal Time Thumbnail New Tea-Time, Deal Time! Visit Changi Airport public areas and unwind with specially-curated tea-time deals. Explore cities we are flying to today View All Kyoto All about onsens & ryokans Rome Top things to see & do Surabaya Perfect for family fun Cebu Best nature activities await Phnom Penh A food journey Melbourne Best day trips Penang Top nature retreats Haikou Recommendations for you Addis Ababa Ethiopia travel guide Jeonju Charming cultural town Bahrain Must-do during your visit Busan Vibran"
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "t coastal city Ipoh Weekend getaway guide Sibu Off-the-beaten destination London Best day trips Tokyo Lesser-known spots to visit Amsterdam Hidden gems to visit Bangkok New things to do Jeju The Hawaii of South Korea Hong Kong Lesser-known attractions Changi Airport Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileg"
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "es Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologi"
  },
  {
    "url": "https://www.changiairport.com/",
    "content": "es (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "Flight Information Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use "
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "Rest Areas Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airpo"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "rt Jewel Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning J"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "ourneys (For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebrati"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "on Quest Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout FLIGHT INFORMATION Keep track of flight timings with live updates. Arrival Receiving a loved one or guest? Check if the flight is on schedule and what the belt number is. Departure Have a flight to catch? Check your terminal, boarding time and gate. Useful Links Flight Information Transport Facilities Airport Map Lost & Found Wifi Access FREQUENTLY ASKED QUESTIONS ABOUT CHANGI AIRPORT'S FLIGHT INFORMATION How can I check the status of my flight at Changi Airport? Visit the Changi Arrival flight or Changi Departure flight pages, or use the Changi App for real-"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "time flight information, including any changes to your flight schedule. Digital boards throughout Changi Airport also display the latest flight timings and status updates, making it easy for you to stay on top of your travel plans. What should I do if my flight is delayed or cancelled? In the event of a delayed or cancelled flight, please check the latest flight status through our website or mobile app, where real-time updates are readily available. It is important to stay in touch with your airline, as they will have the most current information regarding rescheduling or compensation. Are there any restrictions or requirements for international travellers departing from Changi Airport? Inte"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "rnational travellers departing from Changi Airport should be aware that restrictions and requirements can vary depending on the destination country. We recommend checking our airport’s security screening process, as well as regulations outlined by the authorities of your destination country. It’s also crucial to check with your airline for any additional requirements, such as health certifications or pre-departure testing requirements. How early should I arrive at Changi Airport before my flight? For a smooth and stress-free departure, we suggest arriving at Changi Airport at least two hours for short-haul flights and three hours for long-haul flights. This allows sufficient time for check-i"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "n, immigration clearance, and security screening, in addition to enjoying the diverse range of attractions, airport eateries, popular outlets, and relaxation facilities available. Arriving early also ensures you can navigate any unforeseen delays with ease, ensuring a more relaxed start to your journey. What amenities and services are available at Changi Airport for travellers? From airport lounges and quiet rest areas to shopping and dining options, there's something for every traveller at Changi Airport. For those looking to relax before or after their flight, Changi also features beautiful gardens, a cinema, and even a swimming pool with a Jacuzzi. Information counters and customer servic"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "e representatives are also readily available to assist with any travel needs or questions you might have. How can I contact customer support for assistance with flight bookings or inquiries? For assistance with flight bookings or inquiries, Changi Airport's customer support team is always ready to assist you. You can reach us through our mobile app or by calling our customer service hotline. Our dedicated team will provide you with the necessary support, from flight information and schedule changes to general airport inquiries, ensuring your travel experience is as seamless as possible. Are there language options or tools for non-English speaking users to access flight details? Changi Airpor"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "t offers multiple language options on both our website and mobile app, ensuring everyone can easily access flight details and airport information regardless of their native language. Changi Airport Fly Singapore Changi Airport Flight Information & Flight Status Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Ch"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "angi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (f"
  },
  {
    "url": "https://www.changiairport.com/en/fly/flight-information.html",
    "content": "rom changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": "404 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Areas Show"
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": "er and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel Changi"
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": " Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys (For St"
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": "udents) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest Changi"
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": " WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Oops! Looks like this page has departed Don't worry! We'll help you get to your intended destination. Return to the homepage and let's get you on the next available flight. Have a great journey✈️ OK, take me home QUICK LINKS YOU MIGHT NEED AIRPORT GUIDE FLIGHT INFO ARRIVAL GUIDE DEPARTURE GUIDE SPECIAL ASSISTANCE CONTACT INFO Let's Continue Exploring Shop Splurge with the Changi retail experiences. Dine Discover diverse dining options. Promotions Find great deals and exclusive offers. Events Catch the latest buzz, events and what’s happening in Changi Airport right now. Exp"
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": "eriences Discover a realm of entertainment and exploration at Changi Airport. Changi Airport Errors 404 Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign "
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": "up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degra"
  },
  {
    "url": "https://www.changiairport.com/en/plan-your-trip.html",
    "content": "de your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide.html",
    "content": "At Changi Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Area"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide.html",
    "content": "s Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel "
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide.html",
    "content": "Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys ("
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide.html",
    "content": "For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest "
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide.html",
    "content": "Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout At Changi Get through Changi Airport seamlessly with our curated guides and enjoy a touch of magic with our attractions, facilities and services. Explore our terminals Enjoy what each terminal has to offer Terminal 1 Terminal 2 Terminal 3 Terminal 4 Airport Services Flight Information Transport Facilities Airport Map Lost & Found Free Wifi Access Find your way Travel to, from, and within Changi Airport with ease using our comprehensive transport guides. Getting to Changi Getting to Jewel Getting to other terminals Changi Airport At Changi Fly Flight Information Airlin"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide.html",
    "content": "e Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide.html",
    "content": " Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continu"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide/facilities-and-services.html",
    "content": "Facilities & Services Directory Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide/facilities-and-services.html",
    "content": " Free-to-use Rest Areas Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide/facilities-and-services.html",
    "content": " Changi Airport Jewel Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to "
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide/facilities-and-services.html",
    "content": "Do Learning Journeys (For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miff"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide/facilities-and-services.html",
    "content": "y’s Celebration Quest Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Facilities & Services at Changi Airport Discover Changi Airport’s full range of facilities and services from family amenities to business essentials designed to make every journey seamless and comfortable. facility Changi Airport At Changi Explore Changi Airport's Facilities & Services Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping "
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide/facilities-and-services.html",
    "content": "Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovat"
  },
  {
    "url": "https://www.changiairport.com/en/airport-guide/facilities-and-services.html",
    "content": "ive tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi.html",
    "content": "At Changi Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Area"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi.html",
    "content": "s Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi.html",
    "content": "Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys ("
  },
  {
    "url": "https://www.changiairport.com/en/at-changi.html",
    "content": "For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi.html",
    "content": "Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout At Changi Get through Changi Airport seamlessly with our curated guides and enjoy a touch of magic with our attractions, facilities and services. Explore our terminals Enjoy what each terminal has to offer Terminal 1 Terminal 2 Terminal 3 Terminal 4 Airport Services Flight Information Transport Facilities Airport Map Lost & Found Free Wifi Access Find your way Travel to, from, and within Changi Airport with ease using our comprehensive transport guides. Getting to Changi Getting to Jewel Getting to other terminals Changi Airport At Changi Fly Flight Information Airlin"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi.html",
    "content": "e Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi.html",
    "content": " Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continu"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": "404 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Areas Show"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": "er and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel Changi"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": " Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys (For St"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": "udents) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest Changi"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": " WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Oops! Looks like this page has departed Don't worry! We'll help you get to your intended destination. Return to the homepage and let's get you on the next available flight. Have a great journey✈️ OK, take me home QUICK LINKS YOU MIGHT NEED AIRPORT GUIDE FLIGHT INFO ARRIVAL GUIDE DEPARTURE GUIDE SPECIAL ASSISTANCE CONTACT INFO Let's Continue Exploring Shop Splurge with the Changi retail experiences. Dine Discover diverse dining options. Promotions Find great deals and exclusive offers. Events Catch the latest buzz, events and what’s happening in Changi Airport right now. Exp"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": "eriences Discover a realm of entertainment and exploration at Changi Airport. Changi Airport Errors 404 Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": "up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degra"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/attractions-directory.html",
    "content": "de your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "content": "Map Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Areas Show"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "content": "er and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel Changi"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "content": " Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys (For St"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "content": "udents) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest Changi"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "content": " WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Changi Airport At Changi Map Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact In"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "content": "formation Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/map.html",
    "content": " them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": "Terminal 1 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Are"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": "as Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": " Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": "(For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": " Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Terminal 1 A tropical city-inspired terminal with lush greenery and natural light. About Terminal 1 Terminal 1 started operations as Changi's first terminal in 1981. It has since undergone two upgrading and expansion projects. The latest design is based on the thematic concept of a ‘Tropical City’ and it reflects Singapore’s reputation as a garden city. Attractions Discover exciting experiences and must-see spots in T1 Find out more Facilities Enhance your journey with top-notch facilities in T1 Find out more Services Lift your experience with superb services in T1 F"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": "ind out more Retail Splurge in exceptional shopping at T1 Find out more Dining Indulge in culinary delights at T1 Find out more Happenings Catch the latest buzz and what's happening at T1 Find out more AIRPORT SERVICES AT T1 FLIGHTS Hotel TRANSPORT WIFI MAP Special Assistance Changi Airport At Changi Terminal Guides Changi Airport Terminal 1 Guide Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": "for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical techno"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-1.html",
    "content": "logies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": "Terminal 2 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Are"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": "as Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": " Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": "(For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": " Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Terminal 2 Welcome to the all-new Terminal 2 (T2), where nature meets modernity. About Terminal 2 T2 seamlessly merges the realms of architecture and landscape. The terminal’s carpet mirrors natural topography to guide your path, while clouds dance on the ceilings above. By incorporating natural materials and hues, the terminal aims to engender serenity for passengers and visitors alike. Attractions Explore unique attractions and hidden gems at T2 Find out more Facilities Enhance your journey with top-notch facilities in T2 Find out more Services Lift your experience"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": " with superb services in T2 Find out more Retail Find diverse retail experiences here in T2 Find out more Dining Find diverse dining experiences here in T2 Find out more Happenings Catch the latest buzz and what's happening at T2 Find out more website images Visit Hub & Spoke at T2 Find out more AIRPORT SERVICES AT T2 FLIGHTS Hotel TRANSPORT WIFI MAP SPECIAL ASSISTANCE Changi Airport At Changi Terminal Guides Changi Airport Terminal 2 Guide Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": " Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and oth"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-2.html",
    "content": "er innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": "Terminal 3 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Are"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": "as Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": " Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": "(For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": " Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Terminal 3 A hub of modern luxury designed to bring joy and comfort to every traveller. About Terminal 3 T3 is equipped with more than 900 skylights which allow natural daylight into the terminal but keeps the tropical heat at bay. It also has lots of gardens and greenery in the terminal. The centrepiece is a five-storey-high Green Wall while the transit area has a Crystal Garden and the world's first Butterfly Garden in an airport. Attractions Discover nature's beauty and attractions in T3 Find out more Facilities Enhance your journey with top-notch facilities in T3"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": " Find out more Services Lift your experience with superb services in T3 Find out more Retail Splurge with exclusive retail options in T3 Find out more Dining Savour with premier dining options in T3 Find out more Happenings Catch the latest buzz and what's happening at T3 Find out more AIRPORT SERVICES AT T3 FLIGHTS Hotel TRANSPORT WIFI MAP SPECIAL ASSISTANCE Changi Airport At Changi Terminal Guides Changi Airport Terminal 3 Guide Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": "Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovat"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-3.html",
    "content": "ive tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": "Terminal 4 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Are"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": "as Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": " Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys "
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": "(For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": " Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout TERMINAL 4 Where innovation and efficiency come together seamlessly. About Terminal 4 T4 aims to serve a larger community of passengers, ensuring that our passengers can travel with ease of mind with greater travel options. T4 boasts environmentally friendly design elements with optimal use of natural lighting and energy management systems. In 2018, T4 won the Prix Versailles Architectural Award for South Asia and the Pacific as a testament to its state-of-the-art design. Attractions Unforgettable attractions await you at T4 Find out more Facilities Enhance your jour"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": "ney with top-notch facilities in T4 Find out more Services Lift your experience with superb services in T4 Find out more Retail Enjoy retail therapy with a side of affordable eats at T4 Find out more Dining Enjoy retail therapy with a side of affordable eats at T4 Find out more Happenings Catch the latest buzz and what's happening at T4 Find out more Airport Services at T4 FLIGHTS To/From T4 TRANSPORT WIFI MAP SPECIAL ASSISTANCE Changi Airport At Changi Terminal Guides Changi Airport Terminal 4 Guide Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Ho"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": "tels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the"
  },
  {
    "url": "https://www.changiairport.com/en/at-changi/terminal-guides/terminal-4.html",
    "content": " best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": "404 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Areas Show"
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": "er and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel Changi"
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": " Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys (For St"
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": "udents) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest Changi"
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": " WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Oops! Looks like this page has departed Don't worry! We'll help you get to your intended destination. Return to the homepage and let's get you on the next available flight. Have a great journey✈️ OK, take me home QUICK LINKS YOU MIGHT NEED AIRPORT GUIDE FLIGHT INFO ARRIVAL GUIDE DEPARTURE GUIDE SPECIAL ASSISTANCE CONTACT INFO Let's Continue Exploring Shop Splurge with the Changi retail experiences. Dine Discover diverse dining options. Promotions Find great deals and exclusive offers. Events Catch the latest buzz, events and what’s happening in Changi Airport right now. Exp"
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": "eriences Discover a realm of entertainment and exploration at Changi Airport. Changi Airport Errors 404 Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign "
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": "up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degra"
  },
  {
    "url": "https://www.changiairport.com/en/dining.html",
    "content": "de your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": "404 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Areas Show"
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": "er and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel Changi"
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": " Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys (For St"
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": "udents) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest Changi"
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": " WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Oops! Looks like this page has departed Don't worry! We'll help you get to your intended destination. Return to the homepage and let's get you on the next available flight. Have a great journey✈️ OK, take me home QUICK LINKS YOU MIGHT NEED AIRPORT GUIDE FLIGHT INFO ARRIVAL GUIDE DEPARTURE GUIDE SPECIAL ASSISTANCE CONTACT INFO Let's Continue Exploring Shop Splurge with the Changi retail experiences. Dine Discover diverse dining options. Promotions Find great deals and exclusive offers. Events Catch the latest buzz, events and what’s happening in Changi Airport right now. Exp"
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": "eriences Discover a realm of entertainment and exploration at Changi Airport. Changi Airport Errors 404 Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign "
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": "up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degra"
  },
  {
    "url": "https://www.changiairport.com/en/shopping.html",
    "content": "de your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "Contact Us Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Are"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "as Shower and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": " Changi Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys "
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "(For Students) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": " Changi WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout CONTACT INFORMATION Can't find what you're looking for? Don't hesitate to get in touch with us. Flight and Airline Information Lost & Found Other Enquiries Flight Status Information Stay informed of your flight status with real-time updates Departure Flight Status Arrival Flight Status Contact The Airlines The Airline Information page includes ground handlers’ contact information for specific airlines. Airline Information HELPFUL LINKS GETTING AROUND TERMINALS BAGGAGE STORAGE SPECIAL ASSISTANCE Airlines Lost and Found / Baggage Enquiries Lost an item on your flight, "
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "or have any baggage enquiries? Find out how you can contact your airline here . Airport Lost and Found If you lost an item within the airport premises, click here . For public enquiries, feedback, or suggestions on how we can enhance your experience at Changi Airport, please let us know here You may also reach out to chatbot through our modern messaging channels for any general enquiries about Changi Airport. Please note that your personal data may be shared with our partners and other relevant third parties — to enable them to follow up and reply to you directly on your feedback. By providing your personal particulars, you are deemed to have provided your consent to the collection, use or d"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "isclosure of your personal data for this purpose. For on-ground enquiries, please visit the Changi Airport corporate reception . Address: 60 Airport Boulevard Changi Airport Terminal 2, #04-08 Singapore 819643 Jewel Changi Airport For all Jewel-related feedback or enquiries: Tel: +65 6956 9898 Email: contact.us@jewelchangiairport.com Changi Rewards Enquiries For membership and points enquiries, please click here .​ iShopChangi Enquiries For duty-free shopping enquiries, please click here .​ Changi Airport Connector, HUB & SPOKE Changi Airport, Changi Jurassic Mile For venue leasing, events, and partnership enquiries: Email: hubandspoke@changiairport.com Raising Concerns If you have reason to"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": " believe that a Changi Airport Group (CAG) employee, or anyone acting on behalf of CAG has engaged in illegal or otherwise improper conduct, you should promptly report the matter to the CAG Fraud and Ethics hotline. Click here for details of the fraud hotline. To speak to our Changi Experience Ambassador, please contact +65 6595 6868. NEED TO CONTACT OTHERS AT CAG? Corporate Want to speak with someone from Changi Airport Group? Contact us regarding media requests, careers, advertising or business opportunities. Get in Touch CAI Want to speak with someone from Changi Airports International? Contact us if you have enquiries pertaining to consulting and investment services. Get in Touch Changi "
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "Airport App & Help Contact Us | Flight Information & Enquiries Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign up for a Changi Account to receive the la"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "test updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be ch"
  },
  {
    "url": "https://www.changiairport.com/en/help/contact-us.html",
    "content": "anged at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": "About Us Corporate Changi Sites Airport Corporate Careers CAI Jewel Now Boarding About Us About Us × The Changi Airport Story Our Story Our Belief Future Developments Accolades Leadership Business Expertise Air Hub & Cargo Development Airport Operations and Management Airport Concessions Airport Safety and Security Systems and Technology Air Traffic Statistics Passenger Airfreight Commercial Aircraft Subsidiaries Learning Journeys For Adults For Students Sustainability Sustainability × Environment Social Partnering Us Partnering Us × Opportunities Advertising and Sponsorships Airline Partnerships Airport Concessions Cargo Partners Office and Warehouse Leasing Travel Trade Procurement Contact"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": " Information Volunteer with Us Media Hub Media Hub × Newsroom Publications Changi Journeys Reports Image Gallery × All Changi Sites: Language Select: Logout About Us ABOUT CHANGI AIRPORT GROUP As the group behind the world-renowned Changi Airport, we are dedicated to delivering exceptional airport experiences. Here, we share our story of growth, and our commitment to innovation, service excellence and sustainable development. Driven by our purpose, Exceptional People, Connecting Lives, we believe in the potential of our people to create extraordinary impact in the communities we serve. Our Story & Belief The driving force behind our continued success and renowned Changi Experience. Learn mor"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": "e Our Subsidiaries Diversifying our business for customers and partners through top-tiered services to transform travel experiences. Learn more Our Leadership A highly experienced team steers the growth and development of Changi Airport. Learn more Our Expertise Our full range of business functions to run the world's most awarded airport. Learn more FREQUENTLY ASKED QUESTIONS ABOUT CHANGI AIRPORT GROUP What is Changi Airport's history and when was it established? Changi Airport's history traces back to its establishment in 1981, evolving from the relocation from Paya Lebar Airport to meet the burgeoning demand for air travel. This strategic move was aimed at positioning Singapore as a major "
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": "hub in the global aviation network, marking the beginning of Changi's journey towards becoming a world-class airport. How has Changi Airport evolved over the years? Over the years, Changi Airport has undergone significant transformations, marked by the continuous expansion and introduction of innovative facilities and services. From the opening of Terminal 1 in 1981 to the launch of Jewel Changi Airport in 2019, Changi has consistently enhanced its infrastructure to improve passenger experience and operational efficiency. These developments reflect Changi Airport Group's commitment to innovation and excellence in serving the needs of international travellers and the local community. What are"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": " the main facilities available at Changi Airport? Changi Airport is renowned for its comprehensive range of facilities that cater to the needs and preferences of travellers. Key facilities include Jewel Changi Airport , a multi-dimensional lifestyle destination; the world's first butterfly garden in an airport and Kinetic Rain art installation; state-of-the-art airline lounges ; extensive retail and dining options; and innovative services like automated boarding gates and baggage handling systems. These facilities underscore Changi Airport Group's dedication to creating memorable experiences for passengers. How does Changi Airport contribute to sustainability and environmental conservation? "
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": "Changi Airport Group is deeply committed to environmental conservation. Our airport sustainability initiatives include emissions, waste, and water management, alongside the establishment of risk thresholds and mitigation measures for climate resilience. View Changi Sustainability Reports to find out more about our efforts. What community engagement initiatives does Changi Airport participate in? Changi Airport Group actively engages with the community through various initiatives focused on education, youth development, and social responsibility. Programmes such as the Changi Foundation support youths-at-risk, while partnerships with local organisations foster community well-being. These init"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": "iatives reflect Changi's commitment to giving back to the community and making a positive impact beyond its operational boundaries. How many terminals does Changi Airport have, and what are their features? Changi Airport currently boasts four terminals, each designed with unique features to enhance the passenger experience. From the thematic gardens and cultural exhibits in Terminal 1 to the cutting-edge design and automated systems in Terminl 4 , each terminal showcases Changi's dedication to comfort, efficiency, and aesthetic appeal. These terminals collectively offer a seamless and enjoyable travel experience for millions of passengers each year. What future developments or expansions are"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": " planned for Changi Airport? Looking ahead, Changi Airport Group has outlined ambitious plans for future developments, including the Changi East project . This initiative aims to accommodate the anticipated growth in passenger traffic and enhance Changi's capacity and offerings. Plans include a new runway, a mega terminal, and additional facilities to ensure Changi remains at the forefront of global aviation, ready to meet the evolving demands of the future. About Us | Latest News & Careers About Changi Airport Group: Overview and Information About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sus"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": "tainability Environment Social Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to "
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us.html",
    "content": "improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-media-hub/newsroom.html",
    "content": "Newsroom Corporate Changi Sites Airport Corporate Careers CAI Jewel Now Boarding About Us About Us × The Changi Airport Story Our Story Our Belief Future Developments Accolades Leadership Business Expertise Air Hub & Cargo Development Airport Operations and Management Airport Concessions Airport Safety and Security Systems and Technology Air Traffic Statistics Passenger Airfreight Commercial Aircraft Subsidiaries Learning Journeys For Adults For Students Sustainability Sustainability × Environment Social Partnering Us Partnering Us × Opportunities Advertising and Sponsorships Airline Partnerships Airport Concessions Cargo Partners Office and Warehouse Leasing Travel Trade Procurement Contact"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-media-hub/newsroom.html",
    "content": " Information Volunteer with Us Media Hub Media Hub × Newsroom Publications Changi Journeys Reports Image Gallery × All Changi Sites: Language Select: Logout newsroom Catch up on the latest news and access our downloadable resources. Want to receive media releases from Changi Airport? Sign up here. Subscribe Need to contact others at CAG? Subscribe to our Newsletter Want to receive media releases from Changi Airport? Sign up here Learn More Changi Airport Group Want to speak with someone from Changi Airport Group (CAG)? Do reach out to us if you have enquiries pertaining to media, careers, advertising or whistleblowing. Get in Touch About Us | Latest News & Careers Changi Airport Media Hub: S"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-media-hub/newsroom.html",
    "content": "tay Updated with the Latest Happenings News Releases | Singapore Newsroom About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Social Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G.E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Chang"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/our-media-hub/newsroom.html",
    "content": "i Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "Our Story Corporate Changi Sites Airport Corporate Careers CAI Jewel Now Boarding About Us About Us × The Changi Airport Story Our Story Our Belief Future Developments Accolades Leadership Business Expertise Air Hub & Cargo Development Airport Operations and Management Airport Concessions Airport Safety and Security Systems and Technology Air Traffic Statistics Passenger Airfreight Commercial Aircraft Subsidiaries Learning Journeys For Adults For Students Sustainability Sustainability × Environment Social Partnering Us Partnering Us × Opportunities Advertising and Sponsorships Airline Partnerships Airport Concessions Cargo Partners Office and Warehouse Leasing Travel Trade Procurement Contac"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "t Information Volunteer with Us Media Hub Media Hub × Newsroom Publications Changi Journeys Reports Image Gallery × All Changi Sites: Language Select: Logout Our Story Remembering our rich past, reinventing our future. A HISTORY OF FIRSTS 1960s 1970s 1980s 1990s 2000s 2010s 2020s 1959 First passenger flight at Paya Lebar On 28th October 1959, a Qantas' Boeing 707 jetliner touches down at Paya Lebar Airport on its inaugural Kangaroo Route flight from Sydney to London. read more 1960 Paya Lebar Airport hits its stride By 1960, Paya Lebar Airport is handling more than 300,000 passengers and 30,000 aircraft movements a year. It welcomes 11 airlines operating 125 weekly flights. Visitor arrivals "
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "to Singapore hit 100,000. Over the next two years, the runway at Paya Lebar Airport is extended from 2.4km to 2.7km. This makes it one of the longest runways in Asia. read more 1967 Exciting arrivals gain attention On 1st April 1967, BOAC's Super VC-10, the fastest and most powerful civil jet aircraft of its day, lands at Paya Lebar Airport. Despite the airport’s growing reputation, the amenities and services at Paya Lebar are still basic and functional. For instance, passengers have to walk up and down mobile steps to embark and disembark their aircraft. read more 1970 Rapid growth in international aviation In the 1970s, major advances in aviation made international travel more accessible t"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "o passengers. This resulted in rapidly growing passenger numbers. From 1970 to 1975, passenger traffic at Paya Lebar Airport grows almost four-fold from 1.7 million to 4 million passengers a year. read more 1972 Concorde arrives in Singapore Concorde, the world’s first supersonic passenger aircraft is flown by British Airways from London, and lands at Paya Lebar Airport. (Image credit: Singapore Airlines) read more 1975 The big question: expand or move? In 1975, Paya Lebar Airport reaches maximum capacity. Expansion is out of the question since the airport is too close to housing estates. So, the decision is made to move the airport to Changi, where there is ample space for future expansion."
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": " read more 1977 Laying the ground Reclamation and earthworks at Changi, which took two years to be completed. Actual construction of Changi Airport commenced after. read more 1979 Laying a solid foundation for travel Two years later in 1979, the actual construction of Changi Airport begins with the laying of the foundation stone of the Terminal 1 superstructure. On 14 July 1979, SIA and the Civil Aviation Administration of China (CAAC) sign an agreement to establish air links between the two countries, allowing each airline to operate three flights a week. read more 1980 The start of many firsts Even though Changi Airport only officially commenced operations in 1981, we started a series of f"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "irsts in the world. We were first to introduce the concept of airport gardens, as well as the first to allow passengers to make free local telephone calls in transit, and more. As an improvement from Paya Lebar Airport, taxi queues were located indoors so passengers were provided with a completely air-conditioned experience from disembarkation to their taxis. read more 1981 Making the move to Changi On 30 June 1981, the airport moves from Paya Lebar to its new premises at Changi. The following day, Terminal 1 officially becomes operational with the arrival of its first flight—SQ101, carrying 140 passengers from Kuala Lumpur —at 0700 hrs. The first departing flight, SQ192, leaves for Penang a"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "t 0800 hrs on the same day. In just two weeks, 250,000 visitors—or 1 in 10 Singaporeans—visit the airport. Paid tours to the restricted area after immigration are conducted at $0.50 per person. read more 1986 Construction begins on Terminal 2 By 1986, Terminal 1 has surpassed the 10 million passenger mark and construction work for Terminal 2 begins. read more 1988 First 'Best Airport' award In 1988, Changi Airport receives its first 'Best Airport' award from Business Traveller UK. It is also the year a quality service management programme is established to enhance service standards at the airport. read more 1989 SIA first to operate B747-400 SIA becomes the first airline to operate a B747-40"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "0 on a commercial flight across the Pacific. read more 1990 Stringent on quality Changi is served by 52 airlines operating 1,900 weekly flights to 111 cities in 52 countries. Visitor arrivals hit 5.3 million. read more 1991 Terminal 2 opens By the early 1990s, Changi is welcoming 52 airlines operating 1,900 weekly flights to 111 cities in 52 countries. Visitor arrivals hit 5.3 million. In 1991, Terminal 2 officially opens to accommodate the ever-growing number of passengers. In the same year, the Changi Airport Skytrains are launched to offer passengers an efficient, comfortable connection between the two terminals. read more 1993 Princess Diana visits Singapore The late Princess Diana prese"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "nts the 1993 Business Traveller UK Award to Singapore's Permanent Secretary (Transport), Mr Tjong Yik Min. read more 1995 World's first swimming pool in transit In 1995, a rooftop swimming pool opens in the Terminal 1 transit area. The pool, which offers passengers a novel way to refresh after long haul flights, is an instant hit. read more 1997 First Open Skies Agreement signed In 1997, Singapore becomes the first country in Asia to conclude an Open Skies Agreement with the United States of America. In the same year, Changi Airport also surpasses the 20 million passenger mark and celebrates its 10th consecutive year as the 'Best Airport in the World', according to Business Traveller UK. rea"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "d more 1998 New facilities for passengers in transit Thematic lounges, such as a news hub, sports arena, and movie theatre are introduced for passengers to enjoy while in transit. read more 2000 New millennia of technology With the dawn of the new millenium, Changi Airport introduces facilities and services catering to a new generation of technology-savvy travellers. Changi Airport is served by 64 airlines operating 3,400 weekly flights to 145 cities in 50 countries. In October 2000, construction of Terminal 3 begins. read more 2001 'What's your range?' Changi Airport organised the world's first airport gameshow, 'What's Your Range?' in conjunction with the World Cup. Broadband Internet Acce"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "ss is consolidated at Changi Airport's E-Hub and, by 2004, there were 200 Internet terminals available throughout the airport—a record for airports worldwide. read more 2002 Changi Airport MRT opens SMRT officially opens the Changi Airport MRT Station—connecting Changi Airport to Tanah Merah on the East-West (EW) line, bringing another option of commute to the airport. To facilitate the travel process, flight alerts are also made available to passengers via SMS, and flight information is accessible on mobile devices in 2002. read more 2004 Spiderman and automated check-in systems Spiderman climbs down Changi's 80-metre high Control tower in conjunction with the release of the Spiderman movie"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": " in Singapore. In 2004, Changi Airport carries out a six-month trial of the world's first automated check-in system that integrates the check-in and immigration processes for departing travellers. read more 2006 Changi Airport wins first Skytrax title In 2006, Changi Airport wins the inaugural Skytrax World Airport Awards' 'World’s Best Airport' title. On 26 March, the new Budget Terminal opens. Later in the year, Terminal 2 completes a S$240 million upgrade of its facilities and operational systems. On 1 July, Changi Airport celebrates its 25th anniversary. read more 2007 SIA's Airbus A380 in Changi In October 2007, Changi Airport becomes the first airport to welcome the Airbus A380. SIA be"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "comes the world's first airline to fly the A380 between Singapore and Sydney. read more 2008 World's first butterfly garden opens On 1 July 2008, Terminal 3 officially opens. The new terminal features a unique “butterfly” roof which bathes the terminal building in natural sunlight. Not only does the innovative roof offer passengers a new, relaxing experience, it also creates the environment for the world's first, in-airport Butterfly Garden. The Terminal is now home to more than 1,000 free-roaming butterflies and is a tropical nature retreat. In May 2008, extensive refurbishments to Terminal 1 are completed at a cost of S$500 million. Finally, with the Singapore-Kuala Lumpur route fully libe"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "ralised, Singaporean and Malaysian carriers are allowed to operate unlimited flights between the two capitals. read more 2009 Changi Airport is corporatised On 1 July 2009, Changi Airport is corporatised and Changi Airport Group (CAG) is formed. The Company’s immediate and ultimate holding entity is the Minister for Finance, incorporated in Singapore. CAG undertakes key functions focusing on airport operations and management, airhub development, commercial activities and Airport Emergency Services. It effectively takes over the reins from the Civil Aviation Authority of Singapore (CAAS). read more 2010 Soaring to greater heights In 2010, Changi Airport surpasses the 40 million passenger mark"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": ". Intra-regional connectivity in ASEAN is fully established with the commencement of thrice-weekly services between Singapore and Vientiane. Singapore is now connected via direct flights to all nine other ASEAN countries. The retail promotion, 'Be A Changi Millionaire', was launched. This promotion offered the largest cash prize in Singapore. In May 2010, Singapore's tallest slide at 10 metres, Slide@T3 opens. read more 2011 Improving the retail experience In 2011, the Changi Rewards card programme is introduced to encourage retail and dining spend at the airport. Changi Airport introduces Changi Experience Ambassadors (CEAs), deploying roving customer service officers across the airport to "
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "help visitors and passengers. In March that year, with the launch of SIA flights to Sao Paolo, Changi Airport is now directly connected to Brazil. read more 2012 Kinetic Rain unveiled in Terminal 1 By June 2012, Terminal 1's upgrade works are complete. Kinetic Rain , the world's largest moving sculpture, is unveiled in the Departure Hall. Made up of 1,216 bronze droplets, and measuring 9.8m by 4m, the sculpture can form 16 different abstract forms and recognisable shapes. In the same year, Budget Terminal is closed to make way for Terminal 4. The iChangi HD app is launched to provide passengers with real-time access to flight details, terminal maps, and information about airport offerings. C"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "hangi Airport receives its 25th consecutive 'Best Airport' award, from Business Traveller UK. read more 2013 New development plans and e-commerce In 2013, plans for the development of Jewel Changi Airport, Changi East, the three-runway system, and Terminal 5 are announced. A new online shopping portal, iShopChangi, is introduced to offer passengers greater convenience, comfort and value. In November that year, construction of Terminal 4 begins. read more 2014 Construction of Jewel begins In December 2014, c onstruction of Jewel Changi Airport begins. At the same time, the Fast and Seamless Travel (FAST) programme is launched to promote and introduce seamless connectivity for travellers. It w"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "ill be implemented in phases across the airport, including the new Terminal 4. read more 2015 Celebrating our 500th Best Airport award In March 2015, Changi Airport once again receives Skytrax's 'World's Best Airport' award. It’s the 3rd consecutive year the airport has won this outstanding award and the 6th time overall. In June that year, Changi Airport becomes the world's most awarded airport ever, with its 500th Best Airport award since its opening in 1981. read more 2017 Terminal 4 opens Terminal 4 begins operations with nine foundation airlines—AirAsia Group (of four airlines), Cathay Pacific, Cebu Pacific, Korean Air, Spring Airlines and Vietnam Airlines. It has the capacity to handle"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": " 16 million passengers per annum (mppa), bringing Changi’s total capacity to 82 mppa. read more 2018 World's best airport again Changi Airport is voted by air travellers as the World’s Best Airport 2018. This is the first time in the history of the Skytrax awards that an airport has won the title for six consecutive years. read more 2019 Jewel Changi Airport opens Jewel Changi Airport opens on 17 April 2019. read more 2020 Safer journeys amid Covid-19 Amid the Covid-19 pandemic, contactless and cleaning innovations for a safer passenger journey rolls out airport-wide. The innovations include touch-free automated kiosks for check-in and bag drop-offs, as well as biometric face and iris recogn"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "ition systems at immigration. Autonomous cleaning robots are also deployed at the terminals. read more 2020 Transforming F&B with Changi Eats In August, Changi Airport launches food delivery service, Changi Eats. The service allows local diners to enjoy Changi’s extensive food offerings delivered right to their doorsteps with the innovative option of mixing and matching orders from up to five different outlets at Changi Airport and Jewel, and at zero service fees. read more 2020 Changi Airport Connector and Jurassic Mile opens The Changi Airport Connector (CAC), a 3.5-kilometre cycling and jogging path that links Changi Airport to East Coast Park and the Park Connector Network (PCN), officia"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "lly opens on 11 October . The CAC is home to the Changi Jurassic Mile – an outdoor display of more than 30 life-sized dinosaur exhibits. The HUB & SPOKE pit stop facility at Terminal 2, where visitors can rent bicycles, shower, or have a meal, officially opens as well. read more 2021 Covid-19 safety measures stepped up With the rise of the more transmissible Covid-19 Delta variant in May, Changi Airport implements several measures to keep passengers and the airport community safe during this period. These include the introduction of a zoning concept for operations to ring-fence workers in high-risk zones, routine testing for frontline staff, temporary closures of Terminals 1 and 3 as well as"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": " Jewel to the public, and enhanced personal protective equipment (PPE) protocols. All these are introduced on top of existing safe management measures at the airport. The measures are progressively adjusted based on an assessment of risk. read more 2021 World’s Best Airport Staff Despite the challenges brought about by the Covid-19 pandemic, Changi Airport’s heart for service shines through and Changi is recognised for having the world’s best airport staff in 2021 by Skytrax. The award recognises the combined quality of service of all customer-facing staff, including their attitude, friendliness, and efficiency: from staff working at customer help or info counters, to immigration and securit"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "y, retail, and F&B. read more 2021 Changi Pay: Changi’s first digital wallet‎ In October, Changi Airport launches its first digital wallet, Changi Pay. Using Changi Pay, shoppers and diners can make contactless QR payments at Changi Airport and Jewel Changi Airport stores, redeem discount vouchers upon check-out, and seamlessly earn Changi Rewards and CapitaStar points (for Jewel stores) with just one scan. Changi Pay can also be used while shopping on iShopChangi, Changi’s online duty-free retail platform. read more ADDRESSING A GROWING DEMAND Passenger traffic at Changi Airport is expected to grow by 3–4% every year for the next 20 years. At this rate, current airport capacity will be reac"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "hed by the late 2020s.The Changi East development is a response to this expected growth. It’s a bold strategy to maintain Changi Airport’s and Singapore’s competitive edge for the long term. A step in the right direction With a new, third runway, one of the world's largest mega terminals and a range of new exciting facilities, Changi East will ensure Changi Airport is equipped to accommodate and delight ever more passengers and their ever-increasing demands. Find out more A step in the right direction With a new, third runway, one of the world's largest mega terminals and a range of new exciting facilities, Changi East will ensure Changi Airport is equipped to accommodate and delight ever mo"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": "re passengers and their ever-increasing demands. Find out more Other Links Explore other relevant links to help you get started and learn more about our airport community. Our Belief Our Leadership Awards & Accolades Changi Airports International About Us | Latest News & Careers About Changi Airport Group: Overview and Information The Changi Airport Story Our Story About Us The Changi Airport Story Future Developments Accolades Leadership Business Expertise Air Traffic Statistics Subsidiaries Learning Journeys Sustainability Environment Social Partnering Us Opportunities Contact Information Media Hub Newsroom Publications Image Gallery Airport Community ONE Changi Newsletter Changi Service G"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": ".E.M Extra Mile Award Annual Airport Celebration Forms and Manuals Hazard Reporting Follow Us Changi Sites : Corporate Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/our-story.html",
    "content": " functionality may degrade your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": "404 Airport Changi Sites Airport Corporate Careers CAI Jewel Now Boarding Fly Fly × Flight Information Arrival Flight Listing Departure Flight Listing Freighter Flight Listing Arrival Guide Entry Requirements (ICA) Immigration Clearance Customs Declaration Baggage Services Lost Baggage Passenger Meeting Services Leaving Changi Airport Getting Started in Singapore Departure Guide Travel Advisories Pre-flight Check Getting to Changi Airport Early Check-in Fast Check-in Immigration Clearance Tax Refund Security Screening and Baggage Restrictions Transiting Guide Free Singapore Tours Visa-free Transit Facility Transit Hotels Lounges Airline Lounges Pay-per-use Lounges Free-to-use Rest Areas Show"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": "er and Spa Services Airline Information Passenger Airline Information Freighter Airline Information At Changi At Changi × Map Terminal Guides Terminal 1 Terminal 2 Terminal 3 Terminal 4 Transport and Directions Transfer Between Changi Terminals and Jewel Getting to Changi Airport Leaving Changi Airport Coach to Johor Bahru Parking Special Assistance Travelling with Children Persons with Reduced Mobility Persons with Invisible Disability Medical Care Facilities & Services Amenities Assistance Baggage Digital Travel Services Facilities Health & Wellness Hotels Lounges Other Services Transportation Hotels Crowne Plaza Changi Airport Transit Hotels YOTEL AIR Singapore Changi Airport Jewel Changi"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": " Airport Plan Your Visit Attractions Shop Dine Stay Plan Your Events Corporate Weddings Birthdays Dine & Shop Dine & Shop × Dining Cafés Fast Food Fine Dining Food Court Homegrown Brands Pubs & Bars Quick Bites Restaurants Shopping Beauty Children & Maternity Deli & Confectionary Electronics Entertainment Fashion & Accessories Health & Wellness Home & Living Homegrown Brands Lifestyle Luxury Optical Souvenirs, Gifts & Books Sports Supermarket & Convenience Travel Watches & Jewellery Wine & Spirits Changi Pay Changi Rewards Shopping Concierge Shop Online Experience Experience × Attractions Art Gardens Play Experiences for Kids Attractions Activity Videos Things to Do Learning Journeys (For St"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": "udents) Tours Free Singapore Tour Changi Airport Tours Jewel Changi Airport Tours Happenings Happenings × Events Changi First Promotions Changi Rewards Member's Specials Changi Rewards Changi Rewards × Benefits & Privileges Membership Benefits Parking Privileges Changi Rewards Catalogue Specials Events Monarch About Monarch Benefits & Privileges Monarch Specials Monarch Concierge Monarch Parking Monarch FAQs Help FAQs Terms and Conditions Feedback Form Chat App & Help App & Help × Assistance Lost & Found Special Assistance FAQs Changi App Travel Tips Baggage Tracker Book, Redeem & Play Dine with Changi App Changi Pay Changi App Help Centre Download Changi App Miffy’s Celebration Quest Changi"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": " WeChat Contact Information Login/Sign Up Dashboard My Rewards Logout en 中文 × All Changi Sites: Language Select: Logout Oops! Looks like this page has departed Don't worry! We'll help you get to your intended destination. Return to the homepage and let's get you on the next available flight. Have a great journey✈️ OK, take me home QUICK LINKS YOU MIGHT NEED AIRPORT GUIDE FLIGHT INFO ARRIVAL GUIDE DEPARTURE GUIDE SPECIAL ASSISTANCE CONTACT INFO Let's Continue Exploring Shop Splurge with the Changi retail experiences. Dine Discover diverse dining options. Promotions Find great deals and exclusive offers. Events Catch the latest buzz, events and what’s happening in Changi Airport right now. Exp"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": "eriences Discover a realm of entertainment and exploration at Changi Airport. Changi Airport Errors 404 Fly Flight Information Airline Information Arrival Guide Departure Guide Transiting Guide Lounges At Changi Map Terminal Guides Transport & Directions Special Assistance Facilities & Services Hotels Jewel Changi Airport Plan Your Events Dine & Shop Dining Shopping Changi Pay Rewards Shopping Concierge Shop Online Experience Attractions Experiences for Kids Free Tours Happenings Events Promotions Changi Rewards Benefits & Privileges Changi Rewards Catalogue Specials Events Changi Monarch Promotions Help App & Help Assistance Changi App Contact Information Download Changi App Follow us Sign "
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": "up for a Changi Account to receive the latest updates Sign Up Changi Sites : Airport Airport Corporate Careers CAI Jewel Now Boarding Airport Corporate Careers CAI Jewel Now Boarding By-laws & Conditions of Use Privacy Policy Vulnerability Disclosure Policy © 2025 Changi Airport Let’s give you the best experience possible Changi Airport uses cookies and other innovative tech to deliver an incredible and more personalized experience. Analytical technologies give us insights on site usage to improve our services. Marketing technologies (from changiairport.com and trusted partners) help us advertise our services more relevantly. If you choose to keep them off , the basic functionality may degra"
  },
  {
    "url": "https://www.changiairport.com/en/corporate/about-us/the-changi-airport-story/timeline.html",
    "content": "de your experience. Preferences can be changed at any time with future effect. For more information, see our privacy policy . Continue"
  },
  {
    "url": "https://www.jewelchangiairport.com/",
    "content": "Experience Wonder at Jewel Changi Airport - Jewel Changi Airport [Advisory] Due to private events, please be advised that: • Jewel-Rassic Quest will be unavailable from 30 July to 1 August. • The Forest Valley will be partially closed from 30 July to 1 August. • Changi Experience Studio will be closed on 1 August, 5pm to 8pm (last entry at 4pm). • There will be no Light & Music Showcase on 1 August. • All Jewel attractions (except Changi Experience Studio) will be closed on 6 September, 10am to 3pm. Back BUY TICKETS Attractions Membership Individual Corporate Getting to Jewel Search Frequently Searched Attractions EN ZH Home Plan Your Visit Plan Your Visit Visitor Guide Getting to/from Jewel"
  },
  {
    "url": "https://www.jewelchangiairport.com/",
    "content": " Itinerary at Jewel Amenities & Services Changi Lounge Plants at Jewel WHAT'S ON Shopping & Dining Promotions Canopy Park Promotions Jewel Privileges Programme Jewel Vouchers Changi Rewards e-Voucher Flexi eCapitaVoucher EXPLORE Venue Hire Attractions Buyout Weddings at Jewel Wedding Photography at Jewel Team Building at Jewel Discover Jewel Tour Jewel Beleafers Volunteer Programme TOURISTS Tourist Perks & Promotions Tax Refund at Jewel Attractions Attractions Jewel-rassic Quest Walking Net Walking Net - Jewel Changi Airport Bouncing Net Bouncing Net - Jewel Changi Airport Mirror Maze Mirror Maze - Jewel Changi Airport Hedge Maze Hedge Maze - Jewel Changi Airport Mastercard® Canopy Bridge Ma"
  },
  {
    "url": "https://www.jewelchangiairport.com/",
    "content": "stercard® Canopy Bridge - Jewel Changi Airport Discovery Slides Discovery Slides - Jewel Changi Airport Changi Experience Studio Changi Experience Studio - Jewel Changi Airport Jewel Rain Vortex Jewel Rain Vortex - Jewel Changi Airport Canopy Park Canopy Park - Jewel Changi Airport Forest Valley Forest Valley - Jewel Changi Airport Foggy Bowls Foggy Bowls - Jewel Changi Airport Shop Shop Shopping & Dining Promotions Enjoy exclusive offers & deals at Jewel View More VIEW ALL SHOPS Jewel Privileges Programme DINE DINE Shopping & Dining Promotions Enjoy exclusive offers & deals at Jewel View More VIEW ALL DINING STAY STAY Yotelair Relax, rejuvenate and be refreshed at the first YOTELAIR Hotel i"
  },
  {
    "url": "https://www.jewelchangiairport.com/",
    "content": "n Asia. View More Double Rewards Double Rewards Double Rewards The ONLY mall in Singapore serving up to 4.5 % rebate - HIGHEST cashback reward at Jewel Changi Airport! Terms apply. View more Jewel Infinity Programme An exclusive programme for selected Changi Rewards Platinum members View more | Changi Airport EN ZH Your browser does not support the video tag. EXPLORE JEWEL Discover a wondrous world where nature meets retail Celebrate SG60 with Jewel Celebrate Singapore’s 60th birthday with a line-up of exciting events, special showcases, exclusive rewards, and a taste of our nation’s flavour-packed journey—all under one roof at Jewel! Play The first-of-its-kind play attractions at Jewel prom"
  },
  {
    "url": "https://www.jewelchangiairport.com/",
    "content": "ise endless fun for the young and young at heart! Dine Indulge in the wide array of dining options at Jewel! Shop A world-class shopping experience awaits you at Jewel! Stay Relax, rejuvenate and be refreshed at the first YOTEL AIR Hotel in Asia! Purchase Tickets for Canopy Park and the attractions Latest Promotions Grab the latest deals View more Celebrate SG60 with Jewel OCBC Mastercard Campaign JUST BETWEEN US FRIENDS Latest Promotions Grab the latest deals View more CHANGI MILLIONAIRE EXPERIENCES SPEND AND WIN BIG WITH CAPITASTAR YOUR TAX REFUND STARTS AT JEWEL Jewel Features Exclusive programmes at Jewel View more Jewel Privileges Programme Jewel Double Rewards TEAM BUILDING AT JEWEL Je"
  },
  {
    "url": "https://www.jewelchangiairport.com/",
    "content": "wel Features Exclusive programmes at Jewel View more Venues at Jewel Wedding Venues at Jewel Attractions Buyout Featured Plants at Jewel Step out of the airport right into a lush green sanctuary, a tranquil retreat in the core of the world's best transport hub. Jewel houses more than 2,000 trees and palms, and over 10,000 shrubs covering a total area of more than 21,000sqm. There are some 120 species, originating from countries all around the globe. Learn more about the plants at Jewel today! Traveller's Guide Getting to Jewel Traveller's Information Changi Lounge Tax Refund at Jewel Jewel Privileges Programme WELCOME TO JEWEL CHANGI AIRPORT Watch the video to find out more × Close STAY UPDA"
  },
  {
    "url": "https://www.jewelchangiairport.com/",
    "content": "TED Sign up for Jewel's Newsletter Subscribe About Us Career Opportunities Media Centre Contact us Frequently Asked Questions Whistleblowing 78 AIRPORT BOULEVARD, SINGAPORE 819666 ©2024 JEWEL CHANGI AIRPORT DEVT PTE. LTD. Conditions of Use Privacy Policy Thank you Your email has been subscribed for newsletter. Continue Error! Sorry! Your email is already subscribed. Continue By using this site, you agree to our Privacy Policy , Conditions of Access and Cookie Policy to the placement of cookies on your computer."
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions.html",
    "content": "ATTRACTIONS JEWEL ATTRACTIONS Jewel-rassic Quest <p>An augmented reality experience with dinosaurs</p> Walking Net Balance your way through an adventure Bouncing Net Feel like you're bouncing among trees Mirror Maze Lose yourself in a kaleidoscopic escapade Hedge Maze Leafy playscapes you can't resist Mastercard® Canopy Bridge Take a walk through the air Discovery Slides A sculptural playscape Changi Experience Studio <p>A journey of fun and discovery through the exciting virtual world of Changi Airport</p> Jewel Rain Vortex The marvel at Jewel's heart Canopy Park A recreational playground for everyone Forest Valley Explore eternal spring within Jewel Foggy Bowls Play amongst the clouds Peta"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/attractions.html",
    "content": "l Garden The winsome charm of a garden in bloom Topiary Walk A whimsical wonderland Canopy Park Bundle Deals <p>Bundles of fun at Canopy Park</p> LOAD MORE"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/shop.html",
    "content": "Shopping Experience in Jewel While we strive to ensure that the operating hours of our shops and eateries are updated in a timely manner, we seek your understanding that information may change as a result of operational considerations. To avoid disappointment, we recommend checking with the respective store/eatery on their operating hours. × Close 4 / 9 View Filters Reset APPLY FILTERS Clear All LOAD MORE"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/dine.html",
    "content": "Dining Experience in Jewel While we strive to ensure that the operating hours of our shops and eateries are updated in a timely manner, we seek your understanding that information may change as a result of operational considerations. To avoid disappointment, we recommend checking with the respective store/eatery on their operating hours. × Close 4 / 9 View Filters Reset APPLY FILTERS Clear All Load More"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/visit.html",
    "content": "Sorry! We can’t seem to find the page you’re looking for. Here are some helpful links instead: Purchase Attraction Tickets Dining Directory Shopping Directory Promotions Map Back to home"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/contact.html",
    "content": "Sorry! We can’t seem to find the page you’re looking for. Here are some helpful links instead: Purchase Attraction Tickets Dining Directory Shopping Directory Promotions Map Back to home"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/deals.html",
    "content": "Sorry! We can’t seem to find the page you’re looking for. Here are some helpful links instead: Purchase Attraction Tickets Dining Directory Shopping Directory Promotions Map Back to home"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/whats-on.html",
    "content": "Sorry! We can’t seem to find the page you’re looking for. Here are some helpful links instead: Purchase Attraction Tickets Dining Directory Shopping Directory Promotions Map Back to home"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/about-us.html",
    "content": "Sorry! We can’t seem to find the page you’re looking for. Here are some helpful links instead: Purchase Attraction Tickets Dining Directory Shopping Directory Promotions Map Back to home"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/location-getting-here.html",
    "content": "Sorry! We can’t seem to find the page you’re looking for. Here are some helpful links instead: Purchase Attraction Tickets Dining Directory Shopping Directory Promotions Map Back to home"
  },
  {
    "url": "https://www.jewelchangiairport.com/en/faq.html",
    "content": "Sorry! We can’t seem to find the page you’re looking for. Here are some helpful links instead: Purchase Attraction Tickets Dining Directory Shopping Directory Promotions Map Back to home"
  },
  {
    "url": "https://nowboarding.changiairport.com",
    "content": "Now Boarding Travel Blog by Changi | Travel Tips, Stories & Guides 🌎 Travel the World Explore Singapore Discover Changi Search My Articles ChangiAirport.com Travel the World Explore Singapore Discover Changi Search My Articles ChangiAirport.com Travel the World Explore Singapore Discover Changi My Articles Save your favourite articles and find them here ChangiAirport.com Follow Us Fly between Changi Airport and Paris in style: All about Air France’s new La Première suite 17 Jul 2025 Hop on board and discover Air France’s daily Boeing 777-300ER flight between Singapore and Paris, featuring the brand new La Première first class suite. Tips & Guides Travel Why the Southern Lights should be on y"
  },
  {
    "url": "https://nowboarding.changiairport.com",
    "content": "our 2025 travel wishlist 04 Jul 2025 You’ve heard of the Northern Lights: now here’s the Southern Lights! Learn about Aurora Australis and why it deserves to be your 2025 travel adventure. 😍🌌 Activities Tips & Guides The MICHELIN Bib Gourmand Singapore 2025 list unveiled: 11 new eateries added to the selection 17 Jul 2025 Singapore’s culinary scene continues to shine, with 11 new Bib Gourmand establishments in the MICHELIN Guide Singapore 2025. A total of 89 spots make it to the list. Find out which ones you can find in Changi Airport and Jewel! Jewel Changi Airport's new must-visit: The 1872 Clipper Tea Co. Boutique & Tea Bar 14 Jul 2025 Fancy a cup of tea? The 1872 Clipper Tea Co.’s Jewel "
  },
  {
    "url": "https://nowboarding.changiairport.com",
    "content": "outlet takes the tea-drinking experience up a notch with quality, aromatic tea at its multi-sensory tea bar and retail boutique space. Tips & Guides Food and Drink Fly between Changi Airport and Paris in style: All about Air France’s new La Première suite 17 Jul 2025 Hop on board and discover Air France’s daily Boeing 777-300ER flight between Singapore and Paris, featuring the brand new La Première first class suite. Changi Airport Featured Tips & Tricks Why the Southern Lights should be on your 2025 travel wishlist 04 Jul 2025 You’ve heard of the Northern Lights: now here’s the Southern Lights! Learn about Aurora Australis and why it deserves to be your 2025 travel adventure. 😍🌌 Changi Airp"
  },
  {
    "url": "https://nowboarding.changiairport.com",
    "content": "ort Featured Tips & Tricks The MICHELIN Bib Gourmand Singapore 2025 list unveiled: 11 new eateries added to the selection 17 Jul 2025 Singapore’s culinary scene continues to shine, with 11 new Bib Gourmand establishments in the MICHELIN Guide Singapore 2025. A total of 89 spots make it to the list. Find out which ones you can find in Changi Airport and Jewel! Changi Airport Featured Tips & Tricks Jewel Changi Airport's new must-visit: The 1872 Clipper Tea Co. Boutique & Tea Bar 14 Jul 2025 Fancy a cup of tea? The 1872 Clipper Tea Co.’s Jewel outlet takes the tea-drinking experience up a notch with quality, aromatic tea at its multi-sensory tea bar and retail boutique space. Changi Airport Fe"
  },
  {
    "url": "https://nowboarding.changiairport.com",
    "content": "atured Tips & Tricks What's New Follow Us Stay up-to-date with us on our social media channels. Book Your Holiday Make your holiday seamless and book your flights, car and hotel with us! blob WIFI ROUTER Your browser does not support iframes. HOTEL FLIGHT CAR TRANSIT HOTEL Select Terminal Terminal 2 Terminal 3 *This field is mandatory Time *This field is mandatory *This field is mandatory *This field is mandatory Time *This field is mandatory *This field is mandatory *This field is mandatory Time *This field is mandatory SEARCH Taking off from here? You are now leaving Changi Airport Group's website and about to head to a third party site. We have no control over it's content or availability"
  },
  {
    "url": "https://nowboarding.changiairport.com",
    "content": " and do not assume responsibility for any transactions that may occur. No Yes About Privacy Policy Contact Us ChangiAirport.com About Privacy Policy Contact Us ChangiAirport.com © 2025 Changi Airport Singapore. All Rights Reserved. Close By using this site, you agree to our Privacy Policy , Conditions of Access and to the placement of cookies on your computer. ×"
  },
  {
    "url": "https://changiescapechallenge.changiairport.com",
    "content": "Play the Changi Escape Challenge Intro 1 2 3 4 Escape How to play Solve four riddles to escape and complete the challenge. Each password is a single word only with each related to Terminals 1, 2, 3 or Jewel (that’s your first clue!). Passwords do not have to be entered in a particular order. Lastly, tell us which famous celebrity you are. LET'S GET STARTED! 1. Touch down... You’re a famous celebrity transiting in Singapore. You’ve got a few hours to explore Changi Airport before hopping on your flight home and all you want is a low-key layover. You decide to check out the HSBC Rain Vortex for the first time. As you gaze up at it, you can’t believe what you’re seeing. It’s breathtaking. You t"
  },
  {
    "url": "https://changiescapechallenge.changiairport.com",
    "content": "ake your sunglasses off to sneak an unfiltered look — that’s all it takes to get noticed. 2. People around you start whispering and you can see the phones start to come out. Uh oh. You look for a way out and spot the Skytrain above. Perfect. You can slip away from the fans on the train and get to your terminal to make your flight in time. You make your way to Terminal 3 (T3) and hop onto the Skytrain unnoticed. The crowd slowly follows. 3. In your haste, you don’t realise that the carriage is completely empty. As you approach the next terminal, the train oddly doesn’t slow down and continues to glide towards the next stop. After 10 minutes of not stopping at any terminals you soon realise yo"
  },
  {
    "url": "https://changiescapechallenge.changiairport.com",
    "content": "u’re stuck in a loop. You're trapped in the Skytrain! Over the loudspeaker you hear an automated voice. 4. The voice explains that to get off the train, you must solve four riddles within the carriage. If you do, you’ll be dropped off at Terminal 2 (T2) to catch your flight unnoticed. But if you don’t, you’ll be dropped off back at T3, where your fans await. And everytime you pass T3 on the loop, the crowd is getting bigger and more restless. The only way you’re going to get off the train is to solve all four Changi-themed riddles in time. Start FIND YOUR WAY AROUND Start Privacy Policy | Terms & Conditions | Reset progress"
  },
  {
    "url": "https://bod.changiairport.com",
    "content": "Passenger Baggage Delivery You need to enable JavaScript to run this app."
  },
  {
    "url": "https://crsp.changiairport.com",
    "content": "Changi Rewards Staff Programme You need to enable JavaScript to run this app."
  },
  {
    "url": "https://oc.changiairport.com",
    "content": "Login Login Username Password Login Forgot Password? New Applicant Registration New Contractor Registration _______________________ or _______________________ Login For Support Issue, Please Click Here Forgot Password? If you have forgotten your password, you can request for a password reset link. An email containing a password reset link will be sent to you. If you have forgotten your username, please contact system administrator . Username Email Send me the link System best viewed with Chrome, Firefox or IE 11 Loading"
  },
  {
    "url": "https://cmsdirectory.lz.changiairport.com",
    "content": "AIR CMS Management System - PROD Changi airport Media Contents Management System LOGIN ID Password Remember me Forgot / Reset password. Log In OTP Login × OTP code * Your account email OTP code has been sent. * Please check your email and enter your OTP code . * The sent OTP code is valid for 2 minutes . Send Reset Password × ID * Please check your ID (Your Email). * If you would like a new password, we will send you password reset information to your confirmed ID (Your Email) address. Send"
  },
  {
    "url": "https://onechangiadmin.changiairport.com",
    "content": "LoginPage Sign In MOBILE NUMBER +65 +91 +60 PASSWORD New User? Regenerate MFA Account Forgot Password? Need Help? Get Support Due to a scheduled maintenance, the application will not be available from 00:01 AM to 2:00 AM on 27th August 2021 < Back Forgot your password? We’ll help you reset it and get back on track. MOBILE NUMBER +65 +91 +60 An SMS will be sent to your phone containing 6 digit authentication number < Back Forgot your password? We’ll help you reset it and get back on track. MOBILE NUMBER +65 +91 +60 ENTER THE OTP Resend the OTP < Back SET PASSWORD CONFIRM PASSWORD < Back New User? Activate new account with your registered mobile number. MOBILE NUMBER +65 +91 +60 An SMS will be"
  },
  {
    "url": "https://onechangiadmin.changiairport.com",
    "content": " sent to your phone containing 6 digit authentication number < Back New User? Activate new account with your registered mobile number. MOBILE NUMBER +65 +91 +60 ENTER THE OTP Resend the OTP < Back SET PASSWORD CONFIRM PASSWORD"
  },
  {
    "url": "https://playatjewel.jewelchangiairport.com/member/login",
    "content": "If you are a PlayatJewel Member, fill up your email and password to Login to access your pass. To purchase a PlayatJewel Membership, click on Purchase. Purchase Email * Please enter valid email. Password * Please enter your password. Login Forget your password?"
  },
  {
    "url": "https://playatjewel.jewelchangiairport.com/cart/view",
    "content": "Your cart is empty Continue browsing below Back to Home Checking for add ons... Please wait Back Next Step"
  },
  {
    "url": "https://playatjewel-purchase.jewelchangiairport.com/payment/checkout",
    "content": "Checkout Back to Home Contact Information Email* Please provide a valid email to receive your e-tickets. Name Nationality Select Nationality Singapore Afghanistan Albania Algeria Andorra Angola AntiguaandBarbuda Argentina Armenia Austria Australia Azerbaijan Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bhutan Bolivia BosniaandHerzegovina Botswana Brazil Brunei Bulgaria BurkinaFaso Burundi CaboVerde Cambodia Cameroon Canada CentralAfricanRepublic Chad ChannelIslands Chile China Colombia Comoros Congo CostaRica Côted'Ivoire Croatia Cuba Cyprus CzechRepublic Denmark Djibouti Dominica DominicanRepublic DRCongo Ecuador Egypt ElSalvador EquatorialGuinea Eritrea Estonia Eswatini Ethiopi"
  },
  {
    "url": "https://playatjewel-purchase.jewelchangiairport.com/payment/checkout",
    "content": "a FaeroeIslands Finland France FrenchGuiana Gabon Gambia Georgia Germany Ghana Gibraltar Greece Grenada Guatemala Guinea Guinea-Bissau Guyana Haiti HolySee Honduras HongKong Hungary Iceland India Indonesia Iran Iraq Ireland IsleofMan Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Mauritania Mauritius Mayotte Mexico Moldova Monaco Mongolia Montenegro Morocco Mozambique Myanmar Namibia Nepal Netherlands Nicaragua Niger Nigeria NorthKorea NorthMacedonia Norway Oman Pakistan Panama Paraguay Peru Philippines Poland Portugal Qatar Réunion Romania R"
  },
  {
    "url": "https://playatjewel-purchase.jewelchangiairport.com/payment/checkout",
    "content": "ussia Rwanda SaintHelena SaintKittsandNevis SaintLucia SaintVincentandtheGrenadines SanMarino SaoTome&Principe SaudiArabia Senegal Serbia Seychelles SierraLeone Slovakia Slovenia Somalia SouthAfrica SouthKorea SouthSudan Spain SriLanka StateofPalestine Sudan Suriname Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand TheBahamas Timor-Leste Togo TrinidadandTobago Tunisia Turkey Turkmenistan Uganda Ukraine UnitedArabEmirates UnitedKingdom UnitedStates Uruguay Uzbekistan Venezuela Vietnam WesternSahara Yemen Zambia Zimbabwe I would like to receive marketing promotions and updates from Jewel Changi Airport. By making this booking, I confirm that I have read, understood, and agreed with"
  },
  {
    "url": "https://playatjewel-purchase.jewelchangiairport.com/payment/checkout",
    "content": " the following Terms and Conditions. * My Cart (0) Enter Promo Code / Voucher Code Promo Code / Voucher Code Apply Total SGD 0.00"
  }
]